app/desktop/atlas/chart.dot
digraph {
  edge [arrowhead="normal",color="white"]
  graph [layout="dot",bgcolor="#1c1c1c",rankdir="TB",ranksep="1.5"]
  node [shape="box",style="filled",fontcolor="white",color="transparent"]
  ":api:builder" [fillcolor="#160185"]
  ":api:github" [fillcolor="#160185"]
  ":app:desktop" [fillcolor="#7a0101"]
  ":app:di" [fillcolor="#a17103"]
  ":budget:data" [fillcolor="#160185"]
  ":budget:model" [fillcolor="#160185"]
  ":codegen:annotation" [fillcolor="#160185"]
  ":core:di" [fillcolor="#a17103"]
  ":core:model" [fillcolor="#160185"]
  ":logging" [fillcolor="#160185"]
  ":prefs" [fillcolor="#160185"]
  ":api:builder" -> ":core:model" [style="bold"]
  ":api:builder" -> ":logging" [style="dashed"]
  ":api:github" -> ":codegen:annotation" [style="dashed"]
  ":api:github" -> ":core:model" [style="bold"]
  ":app:desktop" -> ":app:di" [style="dashed"]
  ":app:di" -> ":api:builder" [style="dashed"]
  ":app:di" -> ":api:github" [style="bold"]
  ":app:di" -> ":budget:model" [style="bold"]
  ":app:di" -> ":core:di" [style="bold"]
  ":app:di" -> ":core:model" [style="bold"]
  ":app:di" -> ":prefs" [style="bold"]
  ":budget:data" -> ":budget:model" [style="bold"]
  ":budget:data" -> ":core:model" [style="bold"]
  ":budget:data" -> ":logging" [style="dashed"]
  ":core:di" -> ":budget:data" [style="bold"]
  ":core:di" -> ":budget:model" [style="bold"]
  ":prefs" -> ":core:model" [style="bold"]
}
